class Antivirus:
    def __init__(self):
        pass

    def main(self):
        manual = """
        +--------------------------------------+
        | 1 | просмотр программной активности  |
        +--------------------------------------+
        | 2 | проверка файл на наличие вирусов |
        +--------------------------------------+
        | 3 | проверка флешки                  |
        +--------------------------------------+
        | 4 | информация о системе             |
        +--------------------------------------+
        | 5 | сканер портов                    |
        +--------------------------------------+
        | 6 | заблокировать сайт               |
        +--------------------------------------+
        | exit | выйти из Антивируса           |
        +--------------------------------------+
        \n>>>
        """
        while True:
            response = str(input(manual))
            if response == "1":
                pass
            elif response == "2":
                pass
            elif response == "3":
                pass
            elif response == "4":
                pass
            elif response == "5":
                pass
            elif response == "6":
                pass
            elif response == "exit":
                print("завершение работы с Антивирусом")
            else:
                print("Такой цифры нет в списке")